{
  "id": "pdf-reader-and-photo-to-pdf",
  "name": "PDF Reader and Photo to PDF",
  "category": "Productivity",
  "categoryId": "productivity",
  "description": "PDF Reader and Photo to PDF app – the ultimate solution for all your document needs. \n\nThe pdf reader app is more than just a PDF reader and viewer. It serves as an all-in-one file opener, supporting various formats such as XLS, DOCX, and PPT. Whether you need to view spreadsheets, documents, or presentations, this pdf converter app has got you covered. Whether you're a student, professional, or simply looking for an efficient way to manage your files, this pdf viewer app is designed to streamline your document-related tasks.\n\n✅ PDF Reader:\n- Easy to open and read PDF files of any size\n- Whether it's ebooks, reports, presentations, or forms, you can navigate through your documents with ease, zoom in for details, and highlight important information.\n- PDF viewer, e-book reader app\n\n✅ All File Opener:\n- Read all file formats: XLS, DOCX, and PPT.\n- Say goodbye to compatibility issues - effortlessly access, view, and edit various document types within a single application.\n\n✅ Document Scan\n- The built-in document scanning feature allows you to capture text, images, or diagrams from paper documents, turning them into PDFs for easy storage and sharing.\n\n✅ Image to PDF\n- Seamlessly convert images into PDF documents.\n- Whether you have photos, screenshots, or graphics, this pdf document app empowers you to create PDF files from your images, convert to pdf \n\n✅ Share PDF\n- Share your documents hassle-free. The image to pdf converter app lets you send PDFs and other supported files to colleagues, classmates, or friends with a single tap\n\n✅ Orther functions:\n- Manage and delete files\n- Bookmark\n- Search file\n- Document collage\n- Sort file\n\nOur pdf viewer ebook reader app is designed to simplify your document handling tasks, enhancing your productivity and efficiency. Say goodbye to the hassle of juggling multiple pdf document opener apps and tools.\n\nIts simplicity, versatility, and robust features make it an essential pdf viewer all in one app for individuals and professionals who deal with digital documents on a regular basis. Enjoy the document opener app today and experience a whole new level of convenience and efficiency in document management.\n\nThanks for using our pdf file management app!",
  "iconUrl": "https://play-lh.googleusercontent.com/lUN4EkdEcLagQa5QZIni7CVhPqZn2u_5nRyGkx1VeVHDhNr-lDFsoU1a2zjS-xp0-As",
  "rating": 4.188119,
  "downloads": "5M+",
  "version": "1.3.0",
  "updated": "May 16, 2025",
  "requires": "Android 8.0+",
  "developer": "LG apps",
  "installs": "5,000,000+",
  "downloadUrl": "https://play.google.com/store/apps/details?id=com.pdf.editor.viewer.pdfreader.pdfviewer&hl=en&gl=us",
  "googlePlayUrl": "https://play.google.com/store/apps/details?id=com.pdf.editor.viewer.pdfreader.pdfviewer&hl=en&gl=us",
  "screenshots": [
    "https://play-lh.googleusercontent.com/Zw0W83Afm1dzBweFPIr6srTXGMHD7VrSt3NBc5LJFWsByWr-MZ-XDU3y4mvNwaAFv1s",
    "https://play-lh.googleusercontent.com/NpDIF0Or5CB9hykfnX6dw2aagPrbUH5wwxSoF04cxrQmqR9_SCkBHeDRo_h6fJsDBhQr",
    "https://play-lh.googleusercontent.com/UcM0QBflfaVOnLRJr0E_sU5e8F0WKjnQDGEmR17V4sqUEG1nJBVD-4ELeQOLmLR5OEI",
    "https://play-lh.googleusercontent.com/9jpz4xQvSozur2OeZsuquc70Q_GueNV8vYTmNzsmQupIVhLtTyMif45I7xd5SProZgo",
    "https://play-lh.googleusercontent.com/B9ESUIerLz6Z4NveKfVrwE_rDgPGG6fY2YTOWl4m_S8YKLkgPhO7ZIFkAqE30KTNt3R8",
    "https://play-lh.googleusercontent.com/nx_Bz2ck6DJ27i-YgrIUTU-dR5iU3sBiyiabQzQkpxtES7vrCcI-dDLHK2e3ZE79YKs"
  ],
  "isAffiliate": true
}